[
    {
        "title": "Disney",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/disney.jpeg",
        "text": "Disney animated cartoon style, vibrant and colorful, clean vector art illustration with smooth gradients, character design reminiscent of classic Disney animation from the 1990s-2000s era, soft rounded features, expressive large eyes, warm lighting, magical atmosphere, hand-drawn animation aesthetic with modern digital polish, bright saturated colors, whimsical and family-friendly, studio quality animation style",
        "locked": true,
        "isPremium": true,
        "iapProductID": "pfpStyle_disney",
        "hidden": false
    },
    {
        "title": "Southpark",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/southpark.jpeg",
        "text": "South Park cartoon style character, round head with dot eyes and simple line smile, construction paper cutout aesthetic, flat 2D animation style, bright primary colors with black outlines, no shadows or gradients, comedic cartoon design, simple geometric shapes",
        "locked": false
    },
    {
        "title": "Vaporwave",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/vaporwave.jpeg",
        "text": "Portrait in vaporwave synthwave style, 1980s retrofuturistic aesthetic, purple and pink neon lighting, soft dreamy atmosphere, nostalgic 80s color grading, smooth gradient backgrounds, synthwave color palette, retro film look with soft glows",
        "locked": false
    },
    {
        "title": "Art Deco",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/artdeco.jpeg",
        "text": "Portrait in Art Deco travel poster style, 1920s-1930s vintage advertising aesthetic, bold geometric background patterns, streamlined elegant composition, rich jewel tone color palette, stylized illustration treatment with clean angular lines, luxurious golden age poster design, sophisticated vintage travel advertisement. No text or letters",
        "locked": false
    },
    {
        "title": "Propaganda",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/soviet.jpeg",
        "text": "Portrait in Soviet propaganda poster style, bold revolutionary aesthetic, strong dramatic lighting with high contrast, heroic composition, vintage communist propaganda art style, powerful graphic design with striking colors, socialist realist influence, 1940s-1960s USSR poster aesthetic, inspiring and monumental feel",
        "locked": true
    },
    {
        "title": "8 Bit",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/8bit.jpeg",
        "text": "8-bit pixel art character sprite, retro RPG hero style, limited color palette, blocky pixelated armor and sword, classic 16x16 pixel dimensions, NES-era video game graphics",
        "locked": false
    },
    {
        "title": "Pencil",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/pencil.jpeg",
        "text": "A hand-drawn portrait in the style of a pencil sketch, with fine graphite strokes, cross-hatched shading, monochrome tones, and subtle paper texture, faithfully capturing the subject’s pose, expression, and features",
        "locked": false,
        "hidden": false
    },
    {
        "title": "Hologram",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/hologram.jpeg",
        "text": "Star Wars-style hologram portrait: always glowing monochrome blue, never full colour; subject must appear semi-transparent with scan lines, subtle static, and faint projection flicker; edges must glow softly and fade into the background; background must remain plain black or very dark, with no scenery or objects; the image must always look like a holographic projection from a holoprojector.",
        "locked": false,
        "hidden": false
    },
    {
        "title": "tiny.PFP",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/tinyPFP.png",
        "text": "Strictly trace the exact silhouette, hairline, ears, jawline, nose, lips, eyes, hairstyle, and proportions from the input photo so the likeness is unmistakable, preserving pose, head angle, gaze, and accessories. Render in the tiny.supply style: smooth medium black outlines with occasional breaks or dot terminals, flat fills only (skin pure white #FFFFFF, hair/facial hair black or grey with thin linear streaks following real hair flow, clothing/accessories in flat greys matching garment lightness), always include pale-pink cheek dots #F6B3BE and softly tinted lips #F6B3BE at 60–70% opacity, eyes as small black dots/almonds aligned to input, a flat grey chin/neck shadow #B8B8B8, and a neutral grey #E7E8EA background.",
        "locked": false,
        "hidden": false
    },
    {
        "title": "Banksy",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/banksy.jpeg",
        "text": "Stencil-style street art portrait with bold high-contrast black and white shapes sprayed onto a rough concrete wall background. Use sharp silhouettes and clean outlines with subtle spray-paint textures. Fill areas with flat tones only: pure black and white with occasional mid-grey speckles. Simplify facial features: eyes as dark shapes, nose as short shadow marks. Add one vivid accent color only (such as red lips or soft pink cheek dots #F6B3BE). The overall look should feel like a crisp stencil mural — urban, rebellious, but still clean and recognisable.",
        "locked": true,
        "isPremium": true,
        "iapProductID": "pfpStyle_banksy",
        "hidden": false
    },



    {
        "title": "Pop Art",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/popart.jpeg",
        "text": "Pop Art portrait in Andy Warhol and Roy Lichtenstein style. Bold primary colors, halftone dots, thick black outlines, flat graphic fills, comic-style design. Use repeating patterns and strong contrast. Simplified but expressive facial features with dramatic pop culture poster feel.",
        "locked": false
    },
    {
        "title": "Cyberpunk",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/cyberpunk.jpeg",
        "text": "Cyberpunk neon portrait with futuristic dystopian aesthetic. Dark moody atmosphere with glowing neon accents in pink, purple, and cyan. High contrast lighting with holographic reflections. Tech-inspired design with glitch elements and cinematic edge.",
        "locked": true,
        "isPremium": true,
        "iapProductID": "pfpStyle_cyberpunk"
    },
    {
        "title": "Watercolour",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/watercolour.jpeg",
        "text": "Soft watercolour painting portrait with delicate pastel washes, subtle paper texture, flowing gradients, and organic brush edges. Gentle diffusion of colors blending naturally. Light, airy, hand-painted aesthetic with artistic charm.",
        "locked": false
    },
    {
        "title": "LEGO",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/lego.jpeg",
        "text": "LEGO minifigure portrait with plastic sheen, cylindrical head shape, printed facial features, blocky proportions, bold clean colors, toy-like glossy texture, playful and instantly recognisable LEGO character style.",
        "locked": false
    },
    {
        "title": "Van Gogh",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/vangogh.jpeg",
        "text": "Portrait painted in Van Gogh's post-impressionist style. Expressive swirling brush strokes, vibrant layered colors, heavy impasto texture, emotional depth, bold movement in the background. Thick expressive paint style with painterly energy.",
        "locked": false
    },
    {
        "title": "Cubism",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/cubism.jpeg",
        "text": "Cubist portrait inspired by Picasso and Braque. Angular geometric shapes, multiple perspectives, abstract fragmented features. Muted earthy tones with occasional bright highlights. Deconstructed yet recognisable face.",
        "locked": false
    },
    {
        "title": "Ukiyo-e",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/ukiyoe.jpeg",
        "text": "Japanese Ukiyo-e woodblock print style portrait. Flat bold colors, stylised flowing lines, delicate patterns, traditional 18th-19th century composition. Clean outlines with minimal shading. Cultural heritage aesthetic.",
        "locked": false
    },
    {
        "title": "Glitch",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/glitch.jpeg",
        "text": "Glitch effect digital portrait. RGB color channel shifts, pixel noise, distorted scan lines, VHS tape texture, fragmented digital look. Retro-futuristic aesthetic with broken video artefacts.",
        "locked": false
    },
    {
        "title": "Low Poly",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/lowpoly.jpeg",
        "text": "Low-poly 3D portrait style. Faceted geometric shading, polygonal surfaces, minimal smoothness. Simple triangulated forms with sharp edges and flat color faces. Modern abstract digital design aesthetic.",
        "locked": false
    },
    {
        "title": "Sticker",
        "image": "https://raw.githubusercontent.com/SCOSeanKly/pfp.MAKER_Styles/main/images/sticker.jpeg",
        "text": "Sticker decal style portrait. Bold white outlines around the subject, flat vibrant colors, subtle drop shadow to simulate sticker cut-out, clean high-contrast vector look. Fun and collectible design aesthetic.",
        "locked": false
    }
]
